{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "name": "lambda_2", "output_shape_type": "raw", "input_dtype": "float32", "trainable": true, "output_shape": [16, 32, 1], "batch_input_shape": [null, 16, 32, 1], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa5C:/SDCND_P3/CarND-Behavioral-Cloning-Project/model.py\u00da\b<lambda>z\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "name": "convolution2d_2", "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "bias": true, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 12, "nb_row": 3, "b_regularizer": null, "trainable": true, "activation": "linear", "nb_col": 3, "W_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"strides": [4, 4], "border_mode": "valid", "name": "maxpooling2d_2", "trainable": true, "pool_size": [4, 4], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_2", "output_dim": 1, "input_dim": 252, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "b_regularizer": null, "trainable": true, "activation": "linear"}}]}