{"config": [{"class_name": "Lambda", "config": {"arguments": {}, "output_shape_type": "raw", "output_shape": [16, 32, 1], "input_dtype": "float32", "name": "lambda_1", "batch_input_shape": [null, 16, 32, 1], "function_type": "lambda", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-8-e650f341b13c>\u00da\b<lambda>\u0007\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_col": 3, "name": "convolution2d_1", "border_mode": "valid", "nb_filter": 12, "nb_row": 3, "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "b_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [4, 4], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [4, 4]}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "name": "dense_1", "input_dim": 252, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "output_dim": 1}}], "keras_version": "1.2.0", "class_name": "Sequential"}